### Goal
Summarise every exercise of SQL Bolt website and reproduce them in Python

In [1]:
import pandas as pd
import numpy as np

pd.set_option("display.max_rows",100)

### SQL Lesson 1: SELECT queries 101

- Find the title of each film
```mysql
SELECT Title FROM movies;
```
- Find the director of each film
```mysql
SELECT Director FROM movies;
```
- Find the title and director of each film
```mysql
SELECT Title, Director FROM movies;
```
- Find the title and year of each film
```mysql
SELECT Title, Year FROM movies;
```
- Find all the information about each film
```mysql
SELECT * FROM movies;
```

In [2]:
# import CSV
movies = pd.read_csv("data/movies.csv")

In [3]:
# find Title of each film (serie)
movies.Title

0               Toy Story
1            A Bug's Life
2             Toy Story 2
3          Monsters, Inc.
4            Finding Nemo
5         The Incredibles
6                    Cars
7             Ratatouille
8                  WALL-E
9                      Up
10            Toy Story 3
11                 Cars 2
12                  Brave
13    Monsters University
14                 WALL-G
Name: Title, dtype: object

In [4]:
# find Title and year (DataFrame)
movies[["Title","Year"]]

                  Title  Year
0             Toy Story  1995
1          A Bug's Life  1998
2           Toy Story 2  1999
3        Monsters, Inc.  2001
4          Finding Nemo  2003
5       The Incredibles  2004
6                  Cars  2006
7           Ratatouille  2007
8                WALL-E  2008
9                    Up  2009
10          Toy Story 3  2010
11               Cars 2  2011
12                Brave  2012
13  Monsters University  2013
14               WALL-G  2042

In [5]:
# set Id as index in the df
movies = movies.set_index("Id")

### SQL Lesson 2: Queries with constraints (Pt. 1)

- Find the movie with a row id of 6
```mysql
SELECT * FROM movies
WHERE Id = 6;
```
- Find the movies released in the years between 2000 and 2010
```mysql
SELECT * FROM movies
WHERE year BETWEEN 2000 AND 2010;
```
- Find the movies not released in the years between 2000 and 2010
```mysql
SELECT * FROM movies
WHERE year NOT BETWEEN 2000 AND 2010;
```
- Find the first 5 Pixar movies and their release year
```mysql
SELECT * FROM movies
ORDER BY Year
LIMIT 5;
```

In [6]:
# find movie with Id 6
movies.iloc[6]

Title                      Cars
Director          John Lasseter
Year                       2006
Length_minutes              117
Name: 7, dtype: object

In [7]:
# find movies between 2000 and 2010
movies.loc[movies["Year"].ge(2000)&movies["Year"].le(2010)]

              Title        Director  Year  Length_minutes
Id
4    Monsters, Inc.     Pete Docter  2001              92
5      Finding Nemo  Andrew Stanton  2003             107
6   The Incredibles       Brad Bird  2004             116
7              Cars   John Lasseter  2006             117
8       Ratatouille       Brad Bird  2007             115
9            WALL-E  Andrew Stanton  2008             104
10               Up     Pete Docter  2009             101
11      Toy Story 3     Lee Unkrich  2010             103

In [8]:
# find movies not between 2000 and 2010
movies.loc[movies["Year"].le(1999)|movies["Year"].ge(2011)]

                  Title        Director  Year  Length_minutes
Id
1             Toy Story   John Lasseter  1995              81
2          A Bug's Life   John Lasseter  1998              95
3           Toy Story 2   John Lasseter  1999              93
12               Cars 2   John Lasseter  2011             120
13                Brave  Brenda Chapman  2012             102
14  Monsters University     Dan Scanlon  2013             110
87               WALL-G  Brenda Chapman  2042              97

In [9]:
# find first 5 movies from Pixar
movies.sort_values(by=["Year"]).head(5)

             Title        Director  Year  Length_minutes
Id
1        Toy Story   John Lasseter  1995              81
2     A Bug's Life   John Lasseter  1998              95
3      Toy Story 2   John Lasseter  1999              93
4   Monsters, Inc.     Pete Docter  2001              92
5     Finding Nemo  Andrew Stanton  2003             107

### SQL Lesson 3: Queries with constraints (Pt. 2)
- Find all the Toy Story movies
```mysql
SELECT * FROM movies
WHERE Title LIKE "Toy Story%";
```
- Find all the movies directed by John Lasseter
```mysql
SELECT * FROM movies
WHERE Director = "John Lasseter";
```
- Find all the movies (and director) not directed by John Lasseter
```mysql
SELECT * FROM movies
WHERE Director != "John Lasseter";
```
- Find all the WALL-* movies
```mysql
SELECT * FROM movies
WHERE Title LIKE "WALL-%";
```

In [10]:
# find Toy Story movies
movies[movies["Title"].str.contains("Toy Story")]

          Title       Director  Year  Length_minutes
Id
1     Toy Story  John Lasseter  1995              81
3   Toy Story 2  John Lasseter  1999              93
11  Toy Story 3    Lee Unkrich  2010             103

In [11]:
# find movies not directed by John Lasseter
# ~ negative of the series
movies[~movies["Director"].str.contains("John Lasseter")]

                  Title        Director  Year  Length_minutes
Id
4        Monsters, Inc.     Pete Docter  2001              92
5          Finding Nemo  Andrew Stanton  2003             107
6       The Incredibles       Brad Bird  2004             116
8           Ratatouille       Brad Bird  2007             115
9                WALL-E  Andrew Stanton  2008             104
10                   Up     Pete Docter  2009             101
11          Toy Story 3     Lee Unkrich  2010             103
13                Brave  Brenda Chapman  2012             102
14  Monsters University     Dan Scanlon  2013             110
87               WALL-G  Brenda Chapman  2042              97

### SQL Lesson 4: Filtering and sorting Query results
- List all directors of Pixar movies (alphabetically), without duplicates
```mysql
SELECT DISTINCT Director FROM movies
ORDER BY Director;
```
- List the last four Pixar movies released (ordered from most recent to least)
```mysql
SELECT Title FROM movies
ORDER BY Year DESC
LIMIT 4;
```
- List the first five Pixar movies sorted alphabetically
```mysql
SELECT Title FROM movies
ORDER BY Title ASC
LIMIT 5;
```
- List the next five Pixar movies sorted alphabetically
```mysql
SELECT Title FROM movies
ORDER BY Title ASC
LIMIT 5
OFFSET 5;
```

In [12]:
# unique Directors alphabetically
list(movies.sort_values(by="Director").Director.unique())

['Andrew Stanton',
 'Brad Bird',
 'Brenda Chapman',
 'Dan Scanlon',
 'John Lasseter',
 'Lee Unkrich',
 'Pete Docter']

In [13]:
# Last for movies
movies.sort_values(by="Year", ascending = False).head(4)

                  Title        Director  Year  Length_minutes
Id
87               WALL-G  Brenda Chapman  2042              97
14  Monsters University     Dan Scanlon  2013             110
13                Brave  Brenda Chapman  2012             102
12               Cars 2   John Lasseter  2011             120

In [14]:
# movies 6 to 10 alphabetically -- position 5 because python starts from 0
movies.sort_values(by="Title").iloc[5:10]

                  Title       Director  Year  Length_minutes
Id
14  Monsters University    Dan Scanlon  2013             110
4        Monsters, Inc.    Pete Docter  2001              92
8           Ratatouille      Brad Bird  2007             115
6       The Incredibles      Brad Bird  2004             116
1             Toy Story  John Lasseter  1995              81

### SQL Review: Simple SELECT Queries
- List all the Canadian cities and their populations
```mysql
SELECT City, Population FROM north_american_cities
WHERE Country = "Canada";
```
- Order all the cities in the United States by their latitude from north to south
```mysql
SELECT * FROM north_american_cities
WHERE Country = "United States"
ORDER BY Latitude DESC;
```
- List all the cities west of Chicago, ordered from west to east
```mysql
SELECT city, longitude FROM north_american_cities
WHERE
Longitude < (
    SELECT Longitude FROM north_american_cities
    WHERE City = "Chicago")
ORDER BY Longitude ASC;
```
- List the two largest cities in Mexico (by population)
```mysql
SELECT City, Population FROM north_american_cities
WHERE
Country = "Mexico" 
ORDER BY Population DESC
LIMIT 2;
```
- List the third and fourth largest cities (by population) in the United States and their population
```mysql
SELECT City, Population FROM north_american_cities
WHERE
Country = "United States" 
ORDER BY Population DESC
LIMIT 2
OFFSET 2;
```

In [15]:
# import CSV
cities = pd.read_csv("data/north_american_cities.csv")
cities

                   City        Country  Population   Latitude   Longitude
0           Guadalajara         Mexico     1500800  20.659699 -103.349609
1               Toronto         Canada     2795060  43.653226  -79.383184
2               Houston  United States     2195914  29.760427  -95.369803
3              New York  United States     8405837  40.712784  -74.005941
4          Philadelphia  United States     1553165  39.952584  -75.165222
5                Havana           Cuba     2106146  23.054070  -82.345189
6           Mexico City         Mexico     8555500  19.432608  -99.133208
7               Phoenix  United States     1513367  33.448377 -112.074037
8           Los Angeles  United States     3884307  34.052234 -118.243685
9   Ecatepec de Morelos         Mexico     1742000  19.601841  -99.050674
10             Montreal         Canada     1717767  45.501689  -73.567256
11              Chicago  United States     2718782  41.878114  -87.629798

In [16]:
# canadian cities by population
cities[cities["Country"].eq("Canada")][["City","Population"]].sort_values(by="Population")

        City  Population
10  Montreal     1717767
1    Toronto     2795060

In [17]:
# us cities north to south
cities[cities["Country"].eq("United States")].sort_values(by="Latitude", ascending=False)

            City        Country  Population   Latitude   Longitude
11       Chicago  United States     2718782  41.878114  -87.629798
3       New York  United States     8405837  40.712784  -74.005941
4   Philadelphia  United States     1553165  39.952584  -75.165222
8    Los Angeles  United States     3884307  34.052234 -118.243685
7        Phoenix  United States     1513367  33.448377 -112.074037
2        Houston  United States     2195914  29.760427  -95.369803

In [18]:
# cities west of Chicago (longitude < -88), from west to east
cities[cities["Longitude"].le(-88)].sort_values(by="Longitude")

                  City        Country  Population   Latitude   Longitude
8          Los Angeles  United States     3884307  34.052234 -118.243685
7              Phoenix  United States     1513367  33.448377 -112.074037
0          Guadalajara         Mexico     1500800  20.659699 -103.349609
6          Mexico City         Mexico     8555500  19.432608  -99.133208
9  Ecatepec de Morelos         Mexico     1742000  19.601841  -99.050674
2              Houston  United States     2195914  29.760427  -95.369803

In [19]:
# third and fourth largest cities in US
(cities[cities["Country"].eq("United States")]
                         .sort_values(by="Population", ascending=False)
                         .iloc[2:4])

       City        Country  Population   Latitude  Longitude
11  Chicago  United States     2718782  41.878114 -87.629798
2   Houston  United States     2195914  29.760427 -95.369803

### SQL Lesson 6: Multi-table queries with JOINs
- Find the domestic and international sales for each movie
```mysql
SELECT * FROM movies
JOIN boxoffice
    ON Id = Movie_Id;
```
- Show the sales numbers for each movie that did better internationally rather than domestically
```mysql
SELECT * FROM movies
JOIN boxoffice
    ON Id = Movie_Id
WHERE International_sales > Domestic_sales;
```
- List all the movies by their ratings in descending order
```mysql
SELECT * FROM movies
JOIN boxoffice
    ON Id = Movie_Id
ORDER BY Rating DESC;
```

In [20]:
# import CSV
movies = pd.read_csv("data/movies.csv")
boxoffice = pd.read_csv("data/boxoffice.csv")

boxoffice

    Movie_id  Rating  Domestic_sales  International_sales
0          5     8.2       380843261            555900000
1         14     7.4       268492764            475066843
2          8     8.0       206445654            417277164
3         12     6.4       191452396            368400000
4          3     7.9       245852179            239163000
5          6     8.0       261441092            370001000
6          9     8.5       223808164            297503696
7         11     8.4       415004880            648167031
8          1     8.3       191796233            170162503
9          7     7.2       244082982            217900167
10        10     8.3       293004164            438338580
11         4     8.1       289916256            272900000
12         2     7.2       162798565            200600000
13        13     7.2       237283207            301700000

In [21]:
# domestic and international sales of each movie
movies.merge(boxoffice, left_on="Id", right_on="Movie_id")[["Title", "Domestic_sales", "International_sales"]]

                  Title  Domestic_sales  International_sales
0             Toy Story       191796233            170162503
1          A Bug's Life       162798565            200600000
2           Toy Story 2       245852179            239163000
3        Monsters, Inc.       289916256            272900000
4          Finding Nemo       380843261            555900000
5       The Incredibles       261441092            370001000
6                  Cars       244082982            217900167
7           Ratatouille       206445654            417277164
8                WALL-E       223808164            297503696
9                    Up       293004164            438338580
10          Toy Story 3       415004880            648167031
11               Cars 2       191452396            368400000
12                Brave       237283207            301700000
13  Monsters University       268492764            475066843

In [22]:
# movies with more international than domestic sales
mo = movies.merge(boxoffice, left_on="Id", right_on="Movie_id")

mo.loc[mo["Domestic_sales"].le(mo["International_sales"])][["Title", "Domestic_sales", "International_sales"]]

                  Title  Domestic_sales  International_sales
1          A Bug's Life       162798565            200600000
4          Finding Nemo       380843261            555900000
5       The Incredibles       261441092            370001000
7           Ratatouille       206445654            417277164
8                WALL-E       223808164            297503696
9                    Up       293004164            438338580
10          Toy Story 3       415004880            648167031
11               Cars 2       191452396            368400000
12                Brave       237283207            301700000
13  Monsters University       268492764            475066843

In [23]:
mo[["Title", "Rating"]].sort_values(by="Rating", ascending=False)

                  Title  Rating
8                WALL-E     8.5
10          Toy Story 3     8.4
0             Toy Story     8.3
9                    Up     8.3
4          Finding Nemo     8.2
3        Monsters, Inc.     8.1
5       The Incredibles     8.0
7           Ratatouille     8.0
2           Toy Story 2     7.9
13  Monsters University     7.4
1          A Bug's Life     7.2
6                  Cars     7.2
12                Brave     7.2
11               Cars 2     6.4

### SQL Lesson 7: OUTER JOINs
- Find the list of all buildings that have employees
```mysql
SELECT Building FROM employees
GROUP BY Building;
```
- Find the list of all buildings and their capacity
```mysql
SELECT * FROM Buildings;
```
- List all buildings and the distinct employee roles in each building (including empty buildings)
```mysql
SELECT Building_name, Role FROM Buildings
LEFT JOIN Employees
    ON Building_name = Building
GROUP BY 1,2;
```
--- ALTERNATIVE
```mysql
SELECT DISTINCT building_name, role 
FROM buildings 
  LEFT JOIN employees
    ON building_name = building;
```

In [24]:
# import CSV
buildings = pd.read_csv("data/building_name.csv")
employees = pd.read_csv("data/employees.csv")

buildings

  Building_name  Capacity
0            1e        24
1            1w        32
2            2e        16
3            2w        20

In [25]:
# buildings with employees
list(employees["Building"].unique())

['1e', '2w']

In [26]:
# name and roles of building, including the empty ones

(buildings.merge(employees, how="left", left_on="Building_name", right_on="Building")[["Building_name","Role"]]
         .fillna("None")                      # NaN giving problems to group
         .groupby(["Building_name","Role"])   # group both unique columns combination
         .count())                            # groupby requires an aggregator (count, size, sum) to work

Empty DataFrame
Columns: []
Index: [(1e, Engineer), (1e, Manager), (1w, None), (2e, None), (2w, Artist), (2w, Manager)]

### SQL Lesson 8: A short note on NULLs
- Find the name and role of all employees who have not been assigned to a building
```mysql
SELECT * FROM employees
WHERE Building IS NULL;
```
- Find the names of the buildings that hold no employees
```mysql
SELECT DISTINCT Building_name FROM Buildings
LEFT JOIN Employees
    ON Building_name = Building
WHERE Role IS NULL;
```

In [27]:
# find names of building that hold no employees

# create a dataframe with the join
be = buildings.merge(employees, how="left", left_on="Building_name", right_on="Building")
# find the elements that are NaN. In this case, one column is enough (eg Role)
be[be["Role"].isna()]

  Building_name  Capacity Role Name Building  Years_employed
7            1w        32  NaN  NaN      NaN             NaN
8            2e        16  NaN  NaN      NaN             NaN

### SQL Lesson 9: Queries with expressions
- List all movies and their combined sales in millions of dollars
```mysql
SELECT 
    Title,
    (Domestic_sales + International_sales)/1000000 AS "sales (Mio)"
FROM movies
JOIN Boxoffice
    ON Id = Movie_Id;
````
- List all movies and their ratings in percent
```mysql
SELECT 
    title, 
    Rating*10 AS Ratings  
FROM movies
  JOIN boxoffice
    ON movies.id = boxoffice.movie_id;
```
- List all movies that were released on even number years
```mysql
SELECT title, year  
FROM movies
WHERE Year%2 = 0;
```

In [28]:
# create merge movies and boxoffice
mo = movies.merge(boxoffice, left_on="Id", right_on="Movie_id")



# new column of Mio combined domestic + international
millions = 1000000

mo.assign(sales=(mo["Domestic_sales"]+mo["International_sales"])/millions)

,Id,Title,Director,Year,Length_minutes,Movie_id,Rating,Domestic_sales,International_sales,sales
0,1,Toy Story,John Lasseter,1995,81,1,8.3,191796233,170162503,361.958736
1,2,A Bug's Life,John Lasseter,1998,95,2,7.2,162798565,200600000,363.398565
2,3,Toy Story 2,John Lasseter,1999,93,3,7.9,245852179,239163000,485.015179
3,4,"Monsters, Inc.",Pete Docter,2001,92,4,8.1,289916256,272900000,562.816256
4,5,Finding Nemo,Andrew Stanton,2003,107,5,8.2,380843261,555900000,936.743261
5,6,The Incredibles,Brad Bird,2004,116,6,8.0,261441092,370001000,631.442092
6,7,Cars,John Lasseter,2006,117,7,7.2,244082982,217900167,461.983149
7,8,Ratatouille,Brad Bird,2007,115,8,8.0,206445654,417277164,623.722818
8,9,WALL-E,Andrew Stanton,2008,104,9,8.5,223808164,297503696,521.311860
9,10,Up,Pete Docter,2009,101,10,8.3,293004164,438338580,731.342744
10,11,Toy Story 3,Lee Unkrich,2010,103,11,8.4,415004880,648167031,1063.171911
11,12,Cars 2,John Lasseter,2011,120,12,6.4,191452396,368400000,559.852396
12,13,Brave,Brenda Chapman,2012,102,13,7.2,237283207,301700000,538.983207
13,14,Monsters University,Dan Scanlon,2013,110,14,7.4,268492764,475066843,743.559607

In [29]:
# rating in base 100
mo.assign(ratings_perc=mo["Rating"]*10)

,Id,Title,Director,Year,Length_minutes,Movie_id,Rating,Domestic_sales,International_sales,ratings_perc
0,1,Toy Story,John Lasseter,1995,81,1,8.3,191796233,170162503,83.0
1,2,A Bug's Life,John Lasseter,1998,95,2,7.2,162798565,200600000,72.0
2,3,Toy Story 2,John Lasseter,1999,93,3,7.9,245852179,239163000,79.0
3,4,"Monsters, Inc.",Pete Docter,2001,92,4,8.1,289916256,272900000,81.0
4,5,Finding Nemo,Andrew Stanton,2003,107,5,8.2,380843261,555900000,82.0
5,6,The Incredibles,Brad Bird,2004,116,6,8.0,261441092,370001000,80.0
6,7,Cars,John Lasseter,2006,117,7,7.2,244082982,217900167,72.0
7,8,Ratatouille,Brad Bird,2007,115,8,8.0,206445654,417277164,80.0
8,9,WALL-E,Andrew Stanton,2008,104,9,8.5,223808164,297503696,85.0
9,10,Up,Pete Docter,2009,101,10,8.3,293004164,438338580,83.0
10,11,Toy Story 3,Lee Unkrich,2010,103,11,8.4,415004880,648167031,84.0
11,12,Cars 2,John Lasseter,2011,120,12,6.4,191452396,368400000,64.0
12,13,Brave,Brenda Chapman,2012,102,13,7.2,237283207,301700000,72.0
13,14,Monsters University,Dan Scanlon,2013,110,14,7.4,268492764,475066843,74.0

In [30]:
# movies in even years
mo.loc[mo["Year"]%2==0]

,Id,Title,Director,Year,Length_minutes,Movie_id,Rating,Domestic_sales,International_sales
1,2,A Bug's Life,John Lasseter,1998,95,2,7.2,162798565,200600000
5,6,The Incredibles,Brad Bird,2004,116,6,8.0,261441092,370001000
6,7,Cars,John Lasseter,2006,117,7,7.2,244082982,217900167
8,9,WALL-E,Andrew Stanton,2008,104,9,8.5,223808164,297503696
10,11,Toy Story 3,Lee Unkrich,2010,103,11,8.4,415004880,648167031
12,13,Brave,Brenda Chapman,2012,102,13,7.2,237283207,301700000

### SQL Lesson 10: Queries with aggregates (Pt. 1)
- Find the longest time that an employee has been at the studio
```mysql
SELECT MAX(Years_employed) FROM employees;
```
- For each role, find the average number of years employed by employees in that role
```mysql
SELECT 
    Role,
    AVG(Years_employed) AS Avg_years
FROM employees
GROUP BY Role;
```
- Find the total number of employee years worked in each building
```mysql
SELECT 
    Building,
    SUM(Years_employed) AS Total_years
FROM employees
GROUP BY Building;
```

In [31]:
# max amount of years
employees["Years_employed"].max()

9

In [32]:
# avg years per role
employees.groupby("Role").mean()

          Years_employed
Role
Artist               6.0
Engineer             3.4
Manager              6.0

In [33]:
# sum of years
employees.groupby("Building").sum()

          Years_employed
Building
1e                    29
2w                    36

### SQL Lesson 11: Queries with aggregates (Pt. 2)
- Find the number of Artists in the studio (without a HAVING clause)
```mysql
SELECT count(role) 
FROM employees
WHERE Role = "Artist";
```
- Find the number of Employees of each role in the studio
```mysql
SELECT Role, count(role) 
FROM employees
GROUP BY Role;
```
- Find the total number of years employed by all Engineers
```mysql
SELECT Role, SUM(Years_employed)
FROM employees
WHERE Role = "Engineer"
```

In [34]:
# how many roles each one
employees.groupby("Role").count()

          Name  Building  Years_employed
Role
Artist       5         5               5
Engineer     5         5               5
Manager      3         3               3

In [35]:
# years of engineers

employees.groupby("Role").sum()

          Years_employed
Role
Artist                30
Engineer              17
Manager               18

### SQL Lesson 12: Order of execution of a Query
- Find the number of movies each director has directed
```mysql
SELECT Director, count(Title)
FROM movies
GROUP BY Director
ORDER BY 2 DESC;
```
- Find the total domestic and international sales that can be attributed to each director
```mysql
SELECT Director, SUM(Domestic_sales + International_sales)
FROM movies
JOIN Boxoffice
    ON Id = Movie_Id
GROUP BY Director
ORDER BY 2 DESC;
```

In [36]:
# Directors by amount of movies
movies.groupby("Director").size().sort_values(ascending=False)

Director
John Lasseter     5
Pete Docter       2
Brenda Chapman    2
Brad Bird         2
Andrew Stanton    2
Lee Unkrich       1
Dan Scanlon       1
dtype: int64

In [37]:
# sales per director
(mo.assign(Sales=(mo["Domestic_sales"]+mo["International_sales"])/millions)[["Director", "Sales"]]
   .groupby("Director")
   .sum()
   .sort_values(by="Sales", ascending=False))

                      Sales
Director
John Lasseter   2232.208025
Andrew Stanton  1458.055121
Pete Docter     1294.159000
Brad Bird       1255.164910
Lee Unkrich     1063.171911
Dan Scanlon      743.559607
Brenda Chapman   538.983207

### SQL Lesson 13: Inserting rows
- Add the studio's new production, Toy Story 4 to the list of movies (you can use any director)
```mysql
INSERT INTO Movies
VALUES (20, "Toy Story 4", "Josh Cooley", 2019, 100)
```
- Toy Story 4 has been released to critical acclaim! It had a rating of 8.7, and made 340 million domestically and 270 million internationally. Add the record to the BoxOffice table.
```mysql
INSERT INTO Boxoffice
VALUES (20, 8.7, 340000000, 270000000)
```

In [38]:
# append new movie
new_movie = {"Id":15, "Title":"Toy Story 4", "Director":"Josh Cooley", "Year":2019, "Length_minutes":100}

movies.append(new_movie, ignore_index=True)

    Id                Title        Director  Year  Length_minutes
0    1            Toy Story   John Lasseter  1995              81
1    2         A Bug's Life   John Lasseter  1998              95
2    3          Toy Story 2   John Lasseter  1999              93
3    4       Monsters, Inc.     Pete Docter  2001              92
4    5         Finding Nemo  Andrew Stanton  2003             107
5    6      The Incredibles       Brad Bird  2004             116
6    7                 Cars   John Lasseter  2006             117
7    8          Ratatouille       Brad Bird  2007             115
8    9               WALL-E  Andrew Stanton  2008             104
9   10                   Up     Pete Docter  2009             101
10  11          Toy Story 3     Lee Unkrich  2010             103
11  12               Cars 2   John Lasseter  2011             120
12  13                Brave  Brenda Chapman  2012             102
13  14  Monsters University     Dan Scanlon  2013             110
14  87               WALL-G  Brenda Chapman  2042              97
15  15          Toy Story 4     Josh Cooley  2019             100

In [39]:
# append new boxoffice
new_boxoffice = {"Movie_id":15, "Rating":8.7, "Domestic_sales":340000000, "International_sales":270000000}

boxoffice.append(new_boxoffice, ignore_index=True)

    Movie_id  Rating  Domestic_sales  International_sales
0        5.0     8.2     380843261.0          555900000.0
1       14.0     7.4     268492764.0          475066843.0
2        8.0     8.0     206445654.0          417277164.0
3       12.0     6.4     191452396.0          368400000.0
4        3.0     7.9     245852179.0          239163000.0
5        6.0     8.0     261441092.0          370001000.0
6        9.0     8.5     223808164.0          297503696.0
7       11.0     8.4     415004880.0          648167031.0
8        1.0     8.3     191796233.0          170162503.0
9        7.0     7.2     244082982.0          217900167.0
10      10.0     8.3     293004164.0          438338580.0
11       4.0     8.1     289916256.0          272900000.0
12       2.0     7.2     162798565.0          200600000.0
13      13.0     7.2     237283207.0          301700000.0
14      15.0     8.7     340000000.0          270000000.0

### SQL Lesson 14: Updating rows
- The director for A Bug's Life is incorrect, it was actually directed by John Lasseter
```mysql
UPDATE Movies
SET Director = "John Lasseter"
WHERE Id = 2
```
- The year that Toy Story 2 was released is incorrect, it was actually released in 1999
```mysql
UPDATE Movies
SET Year = 1999
WHERE Id = 3
```
- Both the title and director for Toy Story 8 is incorrect! The title should be "Toy Story 3" and it was directed by Lee Unkrich
```mysql
UPDATE Movies
SET
    Title = "Toy Story 3",
    Director = "Lee Unkrich"
WHERE Id = 11
```

In [40]:
# changing the value of a specific row
movies.at[1,"Director"] = "John Change"

movies

    Id                Title        Director  Year  Length_minutes
0    1            Toy Story   John Lasseter  1995              81
1    2         A Bug's Life     John Change  1998              95
2    3          Toy Story 2   John Lasseter  1999              93
3    4       Monsters, Inc.     Pete Docter  2001              92
4    5         Finding Nemo  Andrew Stanton  2003             107
5    6      The Incredibles       Brad Bird  2004             116
6    7                 Cars   John Lasseter  2006             117
7    8          Ratatouille       Brad Bird  2007             115
8    9               WALL-E  Andrew Stanton  2008             104
9   10                   Up     Pete Docter  2009             101
10  11          Toy Story 3     Lee Unkrich  2010             103
11  12               Cars 2   John Lasseter  2011             120
12  13                Brave  Brenda Chapman  2012             102
13  14  Monsters University     Dan Scanlon  2013             110
14  87               WALL-G  Brenda Chapman  2042              97

### SQL Lesson 15: Deleting rows
- This database is getting too big, lets remove all movies that were released before 2005.
```mysql
DELETE FROM Movies
WHERE Year < 2005;
```
- Andrew Stanton has also left the studio, so please remove all movies directed by him.
```mysql
DELETE FROM Movies
WHERE Director = "Andrew Stanton"
```

In [41]:
# drop movies before 2005
movies.drop(movies.loc[movies["Year"].le(2004)].index)

    Id                Title        Director  Year  Length_minutes
6    7                 Cars   John Lasseter  2006             117
7    8          Ratatouille       Brad Bird  2007             115
8    9               WALL-E  Andrew Stanton  2008             104
9   10                   Up     Pete Docter  2009             101
10  11          Toy Story 3     Lee Unkrich  2010             103
11  12               Cars 2   John Lasseter  2011             120
12  13                Brave  Brenda Chapman  2012             102
13  14  Monsters University     Dan Scanlon  2013             110
14  87               WALL-G  Brenda Chapman  2042              97

In [42]:
# drop movies from Andrew Stanton
movies.drop(movies.loc[movies["Director"].eq("Andrew Stanton")].index)

    Id                Title        Director  Year  Length_minutes
0    1            Toy Story   John Lasseter  1995              81
1    2         A Bug's Life     John Change  1998              95
2    3          Toy Story 2   John Lasseter  1999              93
3    4       Monsters, Inc.     Pete Docter  2001              92
5    6      The Incredibles       Brad Bird  2004             116
6    7                 Cars   John Lasseter  2006             117
7    8          Ratatouille       Brad Bird  2007             115
9   10                   Up     Pete Docter  2009             101
10  11          Toy Story 3     Lee Unkrich  2010             103
11  12               Cars 2   John Lasseter  2011             120
12  13                Brave  Brenda Chapman  2012             102
13  14  Monsters University     Dan Scanlon  2013             110
14  87               WALL-G  Brenda Chapman  2042              97

### SQL Lesson 16: Creating tables
Create a new table named Database with the following columns:
– Name A string (text) describing the name of the database
– Version A number (floating point) of the latest version of this database
– Download_count An integer count of the number of times this database was downloaded
This table has no constraints.
```mysql
CREATE TABLE Database (
    Name TEXT,
    Version FLOAT,
    Download_count INTEGER
);
```

In [43]:
# create empty dataframe
Database = pd.DataFrame(columns=["Name", "Version", "Download_count"])

Database

Empty DataFrame
Columns: [Name, Version, Download_count]
Index: []

### SQL Lesson 17: Altering tables
- Add a column named Aspect_ratio with a FLOAT data type to store the aspect-ratio each movie was released in.
```mysql
ALTER TABLE Movies
ADD Aspect_ratio FLOAT
```
- Add another column named Language with a TEXT data type to store the language that the movie was released in. Ensure that the default for this language is English.
```mysql
ALTER TABLE Movies
ADD Language TEXT
    DEFAULT "English"
```

In [44]:
# add empty column
movies.assign(Aspect_ratio="")

    Id                Title        Director  Year  Length_minutes Aspect_ratio
0    1            Toy Story   John Lasseter  1995              81
1    2         A Bug's Life     John Change  1998              95
2    3          Toy Story 2   John Lasseter  1999              93
3    4       Monsters, Inc.     Pete Docter  2001              92
4    5         Finding Nemo  Andrew Stanton  2003             107
5    6      The Incredibles       Brad Bird  2004             116
6    7                 Cars   John Lasseter  2006             117
7    8          Ratatouille       Brad Bird  2007             115
8    9               WALL-E  Andrew Stanton  2008             104
9   10                   Up     Pete Docter  2009             101
10  11          Toy Story 3     Lee Unkrich  2010             103
11  12               Cars 2   John Lasseter  2011             120
12  13                Brave  Brenda Chapman  2012             102
13  14  Monsters University     Dan Scanlon  2013             110
14  87               WALL-G  Brenda Chapman  2042              97

In [45]:
# add column with value
movies.assign(Language="English")

    Id                Title        Director  Year  Length_minutes Language
0    1            Toy Story   John Lasseter  1995              81  English
1    2         A Bug's Life     John Change  1998              95  English
2    3          Toy Story 2   John Lasseter  1999              93  English
3    4       Monsters, Inc.     Pete Docter  2001              92  English
4    5         Finding Nemo  Andrew Stanton  2003             107  English
5    6      The Incredibles       Brad Bird  2004             116  English
6    7                 Cars   John Lasseter  2006             117  English
7    8          Ratatouille       Brad Bird  2007             115  English
8    9               WALL-E  Andrew Stanton  2008             104  English
9   10                   Up     Pete Docter  2009             101  English
10  11          Toy Story 3     Lee Unkrich  2010             103  English
11  12               Cars 2   John Lasseter  2011             120  English
12  13                Brave  Brenda Chapman  2012             102  English
13  14  Monsters University     Dan Scanlon  2013             110  English
14  87               WALL-G  Brenda Chapman  2042              97  English

### SQL Lesson 18: Dropping tables
- We've sadly reached the end of our lessons, lets clean up by removing the Movies table
```mysql
DROP TABLE IF EXISTS Movies;
```
- And drop the BoxOffice table as well
```mysql
DROP TABLE IF EXISTS Boxoffice;
```